smuuze/rpi_control_rp2040/src/driver/usart_driver_rp2040.c
/**
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 *
 * @file    usart0_driver_RP2040.c
 * @author  Sebastian Lesse
 * @date    2022 / 07 / 26
 * @brief   Implementation of a uart0 driver ussable for the Raspberry Pi Pico
 * 
 */

#define TRACER_OFF

// --------------------------------------------------------------------------------

#ifdef TRACER_ON
#warning __WARNING__TRACER_ENABLED__WARNING__
#endif

// --------------------------------------------------------------------------------

#include "config.h"

// --------------------------------------------------------------------------------

#include "tracer.h"

// --------------------------------------------------------------------------------

#include "cpu.h"

// --------------------------------------------------------------------------------

#include "rp2040_reset.h"
#include "rp2040_clock_frequencies.h"

// --------------------------------------------------------------------------------

#include "cfg_driver_interface.h"
#include "local_msg_buffer.h"
#include "driver/communication/usart/usart0_driver.h"
#include "local_module_status.h"

#include "driver/irq/irq_interface.h"

// --------------------------------------------------------------------------------

#define USART_DRIVER_RX_UNLIMITED           0xFFFF

// --------------------------------------------------------------------------------

/**
 * @brief Deepth of the uart1 fifo of the rp2040
 * in number of bytes
 * 
 */
#define RP2040_UART0_FIFO_SIZE              __UNSIGNED(0)

// --------------------------------------------------------------------------------

#ifndef USART0_DRIVER_MAX_NUM_BYTES_TRANSMIT_BUFFER
#define USART0_DRIVER_MAX_NUM_BYTES_TRANSMIT_BUFFER     __UNSIGNED(8)
#endif

#ifndef USART0_DRIVER_MAX_NUM_BYTES_RECEIVE_BUFFER
#define USART0_DRIVER_MAX_NUM_BYTES_RECEIVE_BUFFER      __UNSIGNED(8)
#endif

// --------------------------------------------------------------------------------

#define LOCAL_USART_STATUS_RX_ACTIVE            __UNSIGNED(0)
#define LOCAL_USART_STATUS_TX_ACTIVE            __UNSIGNED(1)

BUILD_MODULE_STATUS_FAST(UART0_STATUS_REG, 2)

// --------------------------------------------------------------------------------

#define UART_DRIVER_POWER_ON                    __UNSIGNED(1)
#define UART_DRIVER_POWER_OFF                   __UNSIGNED(0)

// --------------------------------------------------------------------------------

#define UART_DRIVER_UARTCR_UART_ENABLE          __UNSIGNED(0x00000001)
#define UART_DRIVER_UARTCR_TX_ENABLE            __UNSIGNED(0x00000100)
#define UART_DRIVER_UARTCR_RX_ENABLE            __UNSIGNED(0x00000200)

#define UART_DRIVER_UARTLCR_H_PARITY_NONE       __UNSIGNED(0x00000000)
#define UART_DRIVER_UARTLCR_H_PARITY_EN         __UNSIGNED(0x00000002)
#define UART_DRIVER_UARTLCR_H_PARITY_EVEN      (__UNSIGNED(0x00000004) | UART_DRIVER_UARTLCR_H_PARITY_EN)
#define UART_DRIVER_UARTLCR_H_PARITY_ODD       (__UNSIGNED(0x00000000) | UART_DRIVER_UARTLCR_H_PARITY_EN)
#define UART_DRIVER_UARTLCR_H_FIFO_ENABLE       __UNSIGNED(0x00000010)

#define UART_DRIVER_UARTLCR_H_STOPBITS_1        __UNSIGNED(0x00000000)
#define UART_DRIVER_UARTLCR_H_STOPBITS_2        __UNSIGNED(0x00000008)

#define UART_DRIVER_UARTLCR_H_DATA_BITS_8       __UNSIGNED(0x00000060)
#define UART_DRIVER_UARTLCR_H_DATA_BITS_7       __UNSIGNED(0x00000040)
#define UART_DRIVER_UARTLCR_H_DATA_BITS_6       __UNSIGNED(0x00000020)
#define UART_DRIVER_UARTLCR_H_DATA_BITS_5       __UNSIGNED(0x00000000)

#define UART_DRIVER_UARTDMACR_TX_DMA_EN         __UNSIGNED(0x00000002)
#define UART_DRIVER_UARTDMACR_RX_DMA_EN         __UNSIGNED(0x00000001)

/**
 * @brief If this bit is set in the UARTFR (Flags-Register)
 * the Transmit-Fifo is full. No more data is accepted.
 * 
 */
#define UART_DRIVER_UARTFR_TXFF_BITS            __UNSIGNED(0x00000020)

/**
 * @brief If this bit is set in the UARTFR (Flags-Register)
 * there are received data-bytes avaialble
 * 
 */
#define UART_DRIVER_UARTFR_RXFE_BITS            __UNSIGNED(0x00000010)

#define UART_DRIVER_UARTIFLS_TX_FIFO_LEVEL_1_8  __UNSIGNED(0x00000000)
#define UART_DRIVER_UARTIFLS_TX_FIFO_LEVEL_1_4  __UNSIGNED(0x00000001)
#define UART_DRIVER_UARTIFLS_TX_FIFO_LEVEL_1_2  __UNSIGNED(0x00000002)
#define UART_DRIVER_UARTIFLS_TX_FIFO_LEVEL_3_4  __UNSIGNED(0x00000003)
#define UART_DRIVER_UARTIFLS_TX_FIFO_LEVEL_7_8  __UNSIGNED(0x00000004)

#define UART_DRIVER_UARTIFLS_RX_FIFO_LEVEL_1_8  __UNSIGNED(0x00000000)
#define UART_DRIVER_UARTIFLS_RX_FIFO_LEVEL_1_4  __UNSIGNED(0x00000008)
#define UART_DRIVER_UARTIFLS_RX_FIFO_LEVEL_1_2  __UNSIGNED(0x00000010)
#define UART_DRIVER_UARTIFLS_RX_FIFO_LEVEL_3_4  __UNSIGNED(0x00000018)
#define UART_DRIVER_UARTIFLS_RX_FIFO_LEVEL_7_8  __UNSIGNED(0x00000020)

#define UART_DRIVER_UARTICR_CLEAR_ALL           __UNSIGNED(2047)

#define UART_DRIVER_UARTMIS_RTIM                __UNSIGNED(0x00000040)
#define UART_DRIVER_UARTMIS_TXIM                __UNSIGNED(0x00000020)
#define UART_DRIVER_UARTMIS_RXIM                __UNSIGNED(0x00000010)

// --------------------------------------------------------------------------------

/**
 * @brief FIFO TX-threshold at which the IRQ is activated.
 * Can be set via config.h by the user-application.
 * The default value is 1/2
 * 
 */
#ifndef RP2040_UART_DRIVER_FIFO_TX_LEVEL
#define RP2040_UART_DRIVER_FIFO_TX_LEVEL    UART_DRIVER_UARTIFLS_TX_FIFO_LEVEL_1_8
#endif

#ifndef RP2040_UART_DRIVER_FIFO_RX_LEVEL
#define RP2040_UART_DRIVER_FIFO_RX_LEVEL    UART_DRIVER_UARTIFLS_RX_FIFO_LEVEL_1_8
#endif

// --------------------------------------------------------------------------------

/**
 * @brief Structure to control the UART register of the RP2040
 * @see RP2040 Datasheet (build-date: 2021-03-05 / build-version: 9bf4a25-clean)
 * 
 */
typedef struct {

    /**
     * @brief Data Register, UARTDR
     * See datasheet ch. 4.2.8 - UARTDR Register on page 447
     * for more details.
     */
    io_rw_32 data;

    /**
     * @brief Receive Status Register/Error Clear Register, UARTRSR/UARTECR
     * See datasheet ch. 4.2.8 - UARTDR Register on page 448
     * for more details.
     * 
     */
    io_rw_32 rsr;

    /**
     * @brief Respest the offset of the UARTFR-register.
     * Do not use this.
     */
    uint32_t _pad0[4];

    /**
     * @brief Flag Register, UARTFR
     * See datasheet ch. 4.2.8 - UARTDR Register on page 449
     * for more details.
     */
    io_ro_32 fr;

    /**
     * @brief Respest the offset of the UARTILPR Register
     * Do not use this.
     */
    uint32_t _pad1;

    /**
     * @brief IrDA Low-Power Counter Register, UARTILPR
     * See datasheet ch. 4.2.8 - UARTDR Register on page 450
     * for more details.
     */
    io_rw_32 ilpr;

    /**
     * @brief Integer Baud Rate Register, UARTIBRD
     * See datasheet ch. 4.2.8 - UARTDR Register on page 450
     * for more details.
     */
    io_rw_32 ibrd;

    /**
     * @brief Fractional Baud Rate Register, UARTFBRD
     * See datasheet ch. 4.2.8 - UARTDR Register on page 450
     * for more details.
     */
    io_rw_32 fbrd;

    /**
     * @brief Line Control Register, UARTLCR_H
     * See datasheet ch. 4.2.8 - UARTDR Register on page 451
     * for more details.
     */
    io_rw_32 lcr_h;

    /**
     * @brief Control Register, UARTCR
     * See datasheet ch. 4.2.8 - UARTDR Register on page 452
     * for more details.
     */
    io_rw_32 cr;

    /**
     * @brief Interrupt FIFO Level Select Register, UARTIFLS
     * See datasheet ch. 4.2.8 - UARTDR Register on page 453
     * for more details.
     */
    io_rw_32 ifls;

    /**
     * @brief Interrupt Mask Set/Clear Register, UARTIMSC
     * See datasheet ch. 4.2.8 - UARTDR Register on page 453
     * for more details.
     */
    io_rw_32 imsc;

    /**
     * @brief Raw Interrupt Status Register, UARTRIS
     * See datasheet ch. 4.2.8 - UARTDR Register on page 455
     * for more details.
     */
    io_ro_32 ris;

    /**
     * @brief Masked Interrupt Status Register, UARTMIS
     * See datasheet ch. 4.2.8 - UARTDR Register on page 456
     * for more details.
     */
    io_ro_32 mis;

    /**
     * @brief Interrupt Clear Register, UARTICR
     * See datasheet ch. 4.2.8 - UARTDR Register on page 457
     * for more details.
     */
    io_rw_32 icr;

    /**
     * @brief DMA Control Register, UARTDMACR
     * See datasheet ch. 4.2.8 - UARTDR Register on page 457
     * for more details.
     */
    io_rw_32 dmacr;

} RP2040_UART_REG;

// --------------------------------------------------------------------------------

/**
 * @brief transmit and receive buffer of the uart1 instance of the rp2040
 * Both buffers must only b used within the UART0 isntance.
 * 
 */

BUILD_LOCAL_MSG_BUFFER(
    static inline,
    USART0_TX_BUFFER,
    USART0_DRIVER_MAX_NUM_BYTES_TRANSMIT_BUFFER
)
BUILD_LOCAL_MSG_BUFFER_CLASS(USART0_TX_BUFFER)

BUILD_LOCAL_MSG_BUFFER(
    static inline,
    USART0_RX_BUFFER,
    USART0_DRIVER_MAX_NUM_BYTES_RECEIVE_BUFFER
)
BUILD_LOCAL_MSG_BUFFER_CLASS(USART0_RX_BUFFER)

// --------------------------------------------------------------------------------

/**
 * @brief Driver internal irq-callback for uart0
 */
static void uart0_irq_callback(void);

