smuuze/rpi_control_rp2040/src/driver/usart_driver_rp2040.c
IRQ_BUILD_HANDLER(UART0_IRQ_HANDLER, &uart0_irq_callback, IRQ_NUM_UART0, IRQ_DISABLED)

// --------------------------------------------------------------------------------

/**
 * @brief Returns pointer to access the uart0 register
 * 
 * @return Pointer to the uart0 register
 */
static inline RP2040_UART_REG* uart_driver_get_uart0_reg(void) {
    return ((RP2040_UART_REG*)RP2040_UART0_REG_BASE_ADDRESS);
}

/**
 * @brief Returns pointer to access the uart1 register
 * 
 * @return Pointer to the uart1 register
 */
static inline RP2040_UART_REG* uart_driver_get_uart1_reg(void) {
    return ((RP2040_UART_REG*)RP2040_UART1_REG_BASE_ADDRESS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Enables/disables the given uart-instance.
 * 
 * @param p_uart uart-instance to power on/off
 * @param power_on UART_DRIVER_POWER_ON uart will be powered on
 *                 otherwise uart will be powered off
 */
static void uart_driver_power(RP2040_UART_REG* p_uart, u32 power_on) {

    if (power_on == UART_DRIVER_POWER_ON) {

        DEBUG_PASS("uart_driver_power() - POWER ON");
        p_uart->cr |= UART_DRIVER_UARTCR_UART_ENABLE;

    } else {

        DEBUG_PASS("uart_driver_power() - POWER OFF");
        p_uart->cr &= ~( UART_DRIVER_UARTCR_UART_ENABLE
                   | UART_DRIVER_UARTCR_TX_ENABLE
                   | UART_DRIVER_UARTCR_RX_ENABLE);
    }
}

// --------------------------------------------------------------------------------

/**
 * @brief Starts the TX of the given uart-instance.
 * 
 * @param p_uart uart-instance where to start TX
 */
static void uart_driver_start_tx(RP2040_UART_REG* p_uart) {

    // Enable TX
    p_uart->cr |= UART_DRIVER_UARTCR_TX_ENABLE;
}

// --------------------------------------------------------------------------------

/**
 * @brief Starts the RX of the given uart-instance.
 * 
 * @param p_uart uart-instance where to start RX
 */
static void uart_driver_start_rx(RP2040_UART_REG* p_uart) {

    // Enable RX
    p_uart->cr |= UART_DRIVER_UARTCR_RX_ENABLE;
}

// --------------------------------------------------------------------------------

/**
 * @brief Configures the given baudrate.
 * 
 * @param p_uart refefernce to the uart-instance where to set the baudrate
 * @param baudrate baudrate to be used
 * @param clk_peri_freq current frequency of the CLK-PERI in Hz
 * @return -1 configuring the baudrate has failed,
 * otherwise baudrate was configured successful.
 */
static i32 uart_driver_configure_baudrate(RP2040_UART_REG* p_uart, u32 baudrate, u32 clk_peri_freq) {

    if (clk_peri_freq == 0) {
        DEBUG_PASS("uart_driver_configure_baudrate() - CLOCK-FREQ IST ZERO - ABORT!");
        return -1;
    }

    DEBUG_TRACE_long(clk_peri_freq, "uart_driver_configure_baudrate() - CLOCK-FREQ:");
    DEBUG_TRACE_long(baudrate, "uart_driver_configure_baudrate() - BAUD-RATE:");

    /**
     * @brief See datasheet ch. 4.2.7.1 "Baud Rate Calculation"
     * The original equation is:
     * 
     *      Baud Rate Divisor = (CLK_PERI * 10^6) / (16 * BAUDRATE)
     * 
     * For better handling a fixpoint format is used. the factor is
     * The fixpoint of the IBRD register is 2^6 = 64. For more precision
     * 2^7 = 128 is used within the calculation. The modifies the above
     * equation as follows:
     * 
     *      FIX(Baud Rate Divisor) = 128 * (CLK_PERI * 10^6) / (16 * BAUDRATE)
     *                             =   8 * (CLK_PERI * 10^6) / BAUDRATE
     * 
     * E.g.
     * 
     *      CLK-PERI = 125.000.000 Hz (125 MHz)
     *      BAUDRAT  = 115.200 Baud
     * 
     *      | Original                          | Fixpoint                                                  |
     *      |-----------------------------------|-----------------------------------------------------------|
     *      | baud_rate_div = 125 MHz           | baud_rate_div = 8 * 125 MHz / 115200                      |
     *      |                 / (16 * 115200)   |               = 8680.56                                   |
     *      |               = 67.8168           |                                                           |
     *      |       -> IBRD = 67                |       -> IRBD = baud_rate_div / 128                       |
     *      |       -> FBRD = 0.8168            |               = baud_rate_div >> 7                        |
     *      | FIXPOINT:                         |               = 67                                        |
     *      |     FIX(FBRD) = FBRD * 64 + 0.5   |   > FIX(FBRD) = (baud_rate_div - (IRBD * 128)) / 2        |
     *      |               = 52                |               = ( (baud_rate_div & 0x7F) + 0.5 * 2 ) / 2  |
     *      |                                   |               = ( 104 + 1) / 2                            |
     *      |                                   |               = 52                                        |
     * 
     */

    u32 baud_rate_div = (8 * clk_peri_freq) / baudrate;
    u32 baud_ibrd     = baud_rate_div >> 7;             // integer part
    u32 baud_fbrd     = __UNSIGNED(0);                  // fractional aprt

    if (baud_ibrd == __UNSIGNED(0)) {

        baud_ibrd = __UNSIGNED(1);
        //baud_fbrd = __UNSIGNED(0); // already set

    } else if (baud_ibrd >= __UNSIGNED(65535)) {

        baud_ibrd = __UNSIGNED(65535);
        //baud_fbrd = __UNSIGNED(0); // already set

    }  else {
        baud_fbrd = ((baud_rate_div & 0x7f) + 1) / 2;
    }

    // Load PL011's baud divisor registers
    p_uart->ibrd = baud_ibrd;
    p_uart->fbrd = baud_fbrd;

    DEBUG_TRACE_long(baud_rate_div, "uart_driver_configure_baudrate() - BAUD-DIV:");
    DEBUG_TRACE_long(baud_ibrd, "uart_driver_configure_baudrate() - BAUD-IBRD:");
    DEBUG_TRACE_long(baud_fbrd, "uart_driver_configure_baudrate() - BADU-FBRD");

    // PL011 needs a (dummy) line control register write to latch in the
    // divisors. We don't want to actually change LCR contents here.
    cpu_atomic_bit_set(&p_uart->lcr_h, __UNSIGNED(0));

    // See datasheet
    return (4 * clk_peri_freq) / (64 * baud_ibrd + baud_fbrd);
}

// --------------------------------------------------------------------------------

/**
 * @brief Configures the given uart instance depending on the given configuration
 * 
 * @param p_uart pointer to the uart instance to be configured 
 * @param p_cfg configuration to be used to configure the uart instance
 */
static void uart_driver_configure(
    RP2040_UART_REG* p_uart, TRX_DRIVER_CONFIGURATION* p_cfg
) {

    /**
     * @brief first: check if the peripheral clock was initialized
     * If not, we does not need to continue.
     */
    u32 clk_peri_freq = clock_driver_peripheral_clk_frequency();
    if (clk_peri_freq == 0) {
        DEBUG_PASS("uart_driver_configure() - CLOCK-FREQ IST ZERO - ABORT!");
        return;
    }

    /**
     * @brief Baudrate to use.
     * By default we use 9600 baud.
     */
    u32 baudrate = __UNSIGNED(9600);

