smuuze/rpi_control_rp2040/src/driver/usart_driver_rp2040.c
    switch (p_cfg->module.usart.baudrate) {

        default:
            // no break;
            // fall through

        case BAUDRATE_9600:
            // already set
            DEBUG_PASS("uart_driver_configure() - BAUD - 9600");
            break;

        case BAUDRATE_19200:
            DEBUG_PASS("uart_driver_configure() - BAUD - 19200");
            baudrate = __UNSIGNED(19200);
            break;

        case BAUDRATE_38400:
            DEBUG_PASS("uart_driver_configure() - BAUD - 38400");
            baudrate = __UNSIGNED(38400);
            break;

        case BAUDRATE_115200:
            DEBUG_PASS("uart_driver_configure() - BAUD - 115200");
            baudrate = __UNSIGNED(115200);
            break;

        case BAUDRATE_230400:
            DEBUG_PASS("uart_driver_configure() - BAUD - 230400");
            baudrate = __UNSIGNED(230400);
            break;
    }

    /**
     * @brief Setup the following configuration values
     * and set them all together to the lcr_h register
     * of the actual uart-instance
     * - number of stopbits
     * - parity
     * - number of databits
     */
    u32 lcr_h_cfg = __UNSIGNED(0);

    switch (p_cfg->module.usart.parity) {

        default:
            // no break
            // fall through

        case PARITY_NONE : 
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_PARITY_NONE;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - PARITY - NONE - lcr_h:");
            break;

        case PARITY_EVEN:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_PARITY_EVEN;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - PARITY - EVEN - lcr_h:");
            break;

        case PARITY_ODD:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_PARITY_ODD;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - PARITY - ODD - lcr_h:");
            break;
    }

    switch (p_cfg->module.usart.databits) {
        default:
            // no break
            // fall through

        case DATABITS_9:
            // not available
            // will use 8 databits here
            // no break
            // fall through

        case DATABITS_8:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_DATA_BITS_8;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - DATABITS - 8 - lcr_h:");
            break;

        case DATABITS_5:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_DATA_BITS_5;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - DATABITS - 5 - lcr_h:");
            break;

        case DATABITS_6:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_DATA_BITS_6;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - DATABITS - 6 - lcr_h:");
            break;

        case DATABITS_7:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_DATA_BITS_7;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - DATABITS - 7 - lcr_h:");
            break;
    }

    switch (p_cfg->module.usart.stopbits) {
        default:
            // no break;
            // fall through

        case STOPBITS_1:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_STOPBITS_1;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - STOPBITS - 1 - lcr_h:");
            break;

        case STOPBITS_2:
            lcr_h_cfg |= UART_DRIVER_UARTLCR_H_STOPBITS_2;
            DEBUG_TRACE_long(lcr_h_cfg, "uart_driver_configure() - STOPBITS - 2 - lcr_h:");
            break;
    }

    // Any LCR writes need to take place before enabling the UART
    // this function must be called before lcr_h is set
    __UNUSED__ u32 baud = uart_driver_configure_baudrate(p_uart, baudrate, clk_peri_freq);
    DEBUG_TRACE_long(baud, "uart_driver_configure() - BAUD-VALUE:");

    cpu_atomic_bit_set(&p_uart->lcr_h, lcr_h_cfg);

    // Enable the UART, both TX and RX
    uart_driver_power(p_uart, UART_DRIVER_POWER_ON);
    uart_driver_start_rx(p_uart);
    uart_driver_start_tx(p_uart);
    
    // Enable FIFOs
    DEBUG_PASS("uart_driver_configure() - ENABLE FIFOs");
    cpu_atomic_bit_set(&p_uart->lcr_h, UART_DRIVER_UARTLCR_H_FIFO_ENABLE);

    // enable RX / TX IRQs
    // RXIM and RTIM are required to check for available rx-data via IRQ.
    // - RX asserts when >=4 characters are in the RX-FIFO
    // - RT asserts when there are >=1 characters and no more have been received for 32 bit periods.
    p_uart->imsc = UART_DRIVER_UARTMIS_TXIM | UART_DRIVER_UARTMIS_RXIM;
    
    UART0_IRQ_HANDLER_set_enabled(IRQ_ENABLED);
    irq_set_enabled(IRQ_NUM_UART0, IRQ_ENABLED);

    // set the FIFO threshold levels
    DEBUG_PASS("uart_driver_configure() - SET FIFO THRESHOLD");
    p_uart->ifls = RP2040_UART_DRIVER_FIFO_TX_LEVEL | RP2040_UART_DRIVER_FIFO_RX_LEVEL;

    // Always enable DREQ signals -- no harm in this if DMA is not listening
    p_uart->dmacr = UART_DRIVER_UARTDMACR_TX_DMA_EN
                  | UART_DRIVER_UARTDMACR_RX_DMA_EN;
}

// --------------------------------------------------------------------------------

/**
 * @brief Check if the given uart-inatance is able to accept a new data-byte
 * for transmission.
 * 
 * @param p_uart_inst pointer to the uart-instance to use
 */
static inline u8 usart_driver_is_ready_for_tx(RP2040_UART_REG* p_uart_inst) {

    /**
     * @brief if the transmit FIFO full flag is set
     * the FIFO cannot accept another data-byte.
     * Otherwise one more byte can be stored.
     * 
     */
    return !(p_uart_inst->fr & UART_DRIVER_UARTFR_TXFF_BITS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Check if the RX-fifo of the given uart-isntance is empty or not
 * 
 * @param p_uart_inst uart-instance where to check for an empty fifo
 * @return non-zero if the rx-fifo is empty, otherwise zero.
 */
static inline u8 uart_driver_is_rx_fifo_empty(RP2040_UART_REG* p_uart_inst) {

    /**
     * @brief Receive FIFO empty. The meaning of this
     * bit depends on the state of the FEN bit in the
     * UARTLCR_H Register. If the FIFO is disabled,
     * this bit is set when the receive holding register
     * is empty. If the FIFO is enabled, the RXFE bit is
     * set when the receive FIFO is empty.
     * 
     */
    return (p_uart_inst->fr & UART_DRIVER_UARTFR_RXFE_BITS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Copies num_bytes (as maximum) bytes from p_buffer_from into the hw-fifo
 * of p_uart_inst. If not all bytes fit into the hw-fifo the remaining bytes will
 * not be copied.
 * 
 * @param p_uart_inst reference to the uart-instance where to write the data into
 * @param num_bytes number of bytes to write
 * @param p_buffer_from buffer where to read from
 * @return the number of bytes that have been copied into the uart-fifo
 */
static u16 uart_driver_add_bytes_to_fifo(
    RP2040_UART_REG* p_uart_inst, u32 num_bytes, const u8* const p_buffer_from
) {

    u32 i = __UNSIGNED(0);
    for ( ; i < num_bytes; ++i) {

