smuuze/rpi_control_rp2040/src/driver/usart_driver_rp2040.c
        if (!usart_driver_is_ready_for_tx(p_uart_inst)) {
            DEBUG_TRACE_long(i, "uart_driver_add_bytes_to_fifo() - FIFO FULL - BYTES WRITTEN:");
            break;
        }

        p_uart_inst->data = p_buffer_from[i];

        #ifdef UNITTEST_SET_FIFO_DATA_CALLBACK
        {
            UNITTEST_SET_FIFO_DATA_CALLBACK
        }
        #endif
    }

    return i;
}

// --------------------------------------------------------------------------------

/**
 * @brief Copies the bytes of the given message-buffer into the fifo of the given
 * uart-instance. Only the number of bytes that fit into the fifo are copied.
 * The remaining bytes will stay inside of the message-buffer
 * 
 * @param p_uart_inst instance of the uart where to fill the fifo
 * @param p_msg_buffer class-object of the message-buffer from where to read the bytes
 */
static void uart_driver_copy_buffer_to_fifo(
    RP2040_UART_REG* p_uart_inst, const LOCAL_MSG_BUFFER_CLASS* p_msg_buffer
) {

    p_msg_buffer->start_read();

    while (p_msg_buffer->bytes_available()) {

        if (!usart_driver_is_ready_for_tx(p_uart_inst)) {
            DEBUG_PASS("uart_driver_copy_buffer_to_fifo() - FIFO FULL");
            break;
        }

        p_uart_inst->data = p_msg_buffer->get_byte();

        #ifdef UNITTEST_SET_FIFO_DATA_CALLBACK
        {
            UNITTEST_SET_FIFO_DATA_CALLBACK
        }
        #endif
    }

    p_msg_buffer->stop_read();
}

// --------------------------------------------------------------------------------

/**
 * @brief Copies the bytes of the rx-fifo into the rx-buffer.
 * 
 * @param p_uart_inst uart-instance from where the bytes are read
 * @param p_msg_buffer message buffer where to store the bytes into
 */
static void uart_driver_copy_fifo_to_buffer (
    RP2040_UART_REG* p_uart_inst, const LOCAL_MSG_BUFFER_CLASS* p_msg_buffer
) {

    p_msg_buffer->start_write();

    while (p_msg_buffer->bytes_free()) {

        if (uart_driver_is_rx_fifo_empty(p_uart_inst)) {
            DEBUG_PASS("uart_driver_copy_fifo_to_buffer() - FIFO IS EMPTY");
            break;
        }

        #ifdef UNITTEST_GET_FIFO_DATA_CALLBACK
        {
            UNITTEST_GET_FIFO_DATA_CALLBACK
        }
        #endif

        u32 data = p_uart_inst->data;
        if (data > (0xFF)) {
            // this is an error (OE / PE / BE / FE)
            DEBUG_TRACE_long(data, "uart_driver_copy_fifo_to_buffer() - FIFO ERROR:");
            break;
        }

        DEBUG_TRACE_long(data, "uart_driver_copy_fifo_to_buffer() - DATA:");
        p_msg_buffer->add_byte(data);
    }

    p_msg_buffer->stop_write();
}

// --------------------------------------------------------------------------------

/**
 * @brief Sets num_bytes from p_msg_buffer into the uart-fifo of p_uart_inst
 * and/or the message-buffer p_msg_buffer.
 * First, this fucntions tries to write as much as possible bytes into the fifo
 * of the given uart-instance. If there are bytes left that does not fit into the
 * fifo these bytes will be written into the message-buffer.
 * 
 * @param p_uart_inst uart-isntance where to write the fifo
 * @param p_msg_buffer message buffer where to write remaining bytes into
 * @param num_bytes number of bytes to write
 * @param p_buffer_from bufer holding the bytes to copy into the uart
 * @return summary of bytes that have been written into the uart-fifo and/or the
 * message-buffer.
 */
static u16 uart_driver_set_N_bytes(
    RP2040_UART_REG* p_uart_inst,
    const LOCAL_MSG_BUFFER_CLASS* p_msg_buffer,
    const u16 num_bytes,
    const u8* const p_buffer_from
) {

    /**
     * @brief try to write as much as possible into the uarts hw-fifo
     */
    u16 bytes_written = uart_driver_add_bytes_to_fifo(
        p_uart_inst,
        num_bytes,
        &p_buffer_from[0]
    );

    DEBUG_TRACE_long(bytes_written, "uart_driver_set_N_bytes() - BYTES WRITTEN INTO FIFO:");

    /**
     * @brief try to write the remaining bytes into the sw-buffer
     */
    if (bytes_written < num_bytes) {
        p_msg_buffer->start_write();
        {
            bytes_written += p_msg_buffer->add_n_bytes(
                num_bytes - bytes_written,
                &p_buffer_from[bytes_written]
            );
        }
        p_msg_buffer->stop_write();
    }

    DEBUG_TRACE_long(bytes_written, "uart_driver_set_N_bytes() - BYTES WRITTEN:");

    /**
     * @brief return the number of bytes that have been stored
     * to inform the user if some of them have not.
     */
    return bytes_written;
}

// --------------------------------------------------------------------------------

/**
 * @see usart0_driver.h#usart0_driver_initialize
 */
void usart0_driver_initialize(void) {

    DEBUG_PASS("usart0_driver_initialize()");

    UART0_STATUS_REG_clear_all();
    USART0_TX_BUFFER_clear_all();
    USART0_RX_BUFFER_clear_all();

    rp2040_reset_uart0();// blocks until uart0 is resetted

    if (UART0_IRQ_HANDLER_init() != IRQ_INTERFACE_OK) {
        DEBUG_PASS("usart0_driver_initialize() - INIT UART0-IRQ-HANDLER HAS FAILED");
        return;
    }
}

/**
 * @see usart0_driver.h#usart0_driver_configure
 */
void usart0_driver_configure(TRX_DRIVER_CONFIGURATION* p_cfg) {
    uart_driver_configure(uart_driver_get_uart0_reg(), p_cfg);
}

/**
 * @see usart0_driver.h#usart0_driver_power_off
 */
void usart0_driver_power_off(void) {
    uart_driver_power(
        uart_driver_get_uart0_reg(),
        UART_DRIVER_POWER_OFF
    );
}

/**
 * @see usart0_driver.h#usart0_driver_bytes_available
 */
u16 usart0_driver_bytes_available(void) {
    return USART0_RX_BUFFER_bytes_available();
}

/**
 * @see usart0_driver.h#usart0_driver_get_N_bytes
 */
u16 usart0_driver_get_N_bytes(u16 num_bytes, u8* p_buffer_to) {
    USART0_RX_BUFFER_start_read();
    u16 bytes_read = USART0_RX_BUFFER_get_N_bytes(num_bytes, p_buffer_to);
    USART0_RX_BUFFER_stop_read();
    return bytes_read;
}

/**
 * @see usart0_driver.h#usart0_driver_set_N_bytes
 */
u16 usart0_driver_set_N_bytes(u16 num_bytes, const u8* const p_buffer_from) {

