smuuze/rpi_control_rp2040/src/driver/usart_driver_rp2040.c
    return uart_driver_set_N_bytes(
        uart_driver_get_uart0_reg(),
        USART0_TX_BUFFER_get_class(),
        num_bytes,
        p_buffer_from
    );
}

/**
 * @see usart0_driver.h#usart0_driver_is_ready_for_rx
 */
u8 usart0_driver_is_ready_for_rx(void) {
    return 1;
}

/**
 * @see usart0_driver.h#usart0_driver_start_rx
 */
void usart0_driver_start_rx(u16 num_of_rx_bytes) {
    (void) num_of_rx_bytes;
    uart_driver_start_rx(uart_driver_get_uart0_reg());
}

/**
 * @see usart0_driver.h#usart0_driver_wait_for_rx
 */
void usart0_driver_wait_for_rx(u16 num_bytes, u16 timeout_ms) {
    (void) num_bytes;
    (void) timeout_ms;
}

/**
 * @see usart0_driver.h#usart0_driver_stop_rx
 */
void usart0_driver_stop_rx (void) {

}

/**
 * @see usart0_driver.h#usart0_driver_is_ready_for_tx
 */
u8 usart0_driver_is_ready_for_tx (void) {
    return usart_driver_is_ready_for_tx(uart_driver_get_uart0_reg()) ;
}

/**
 * @see usart0_driver.h#usart0_driver_start_tx
 */
void usart0_driver_start_tx (void) {
    uart_driver_start_tx(uart_driver_get_uart0_reg());
}

/**
 * @see usart0_driver.h#usart0_driver_wait_for_tx
 */
void usart0_driver_wait_for_tx(u16 num_bytes, u16 timeout_ms) {
    (void) num_bytes;
    (void) timeout_ms;
}

/**
 * @see usart0_driver.h#usart0_driver_stop_tx
 */
void usart0_driver_stop_tx (void) {

}

/**
 * @see usart0_driver.h#usart0_driver_clear_rx_buffer
 */
void usart0_driver_clear_rx_buffer(void) {
    USART0_RX_BUFFER_clear_all();
}

/**
 * @see usart0_driver.h#usart0_driver_clear_tx_buffer
 */
void usart0_driver_clear_tx_buffer(void) {
    USART0_TX_BUFFER_clear_all();
}

/**
 * @see usart0_driver.h#usart0_driver_set_address
 */
void usart0_driver_set_address (u8 addr) {
    (void) addr;
}

/**
 * @see usart0_driver.h#usart0_driver_mutex_request
 */
u8 usart0_driver_mutex_request(void) {
    return 1;
}

/**
 * @see usart0_driver.h#usart0_driver_mutex_release
 */
void usart0_driver_mutex_release(u8 m_id) {
    (void) m_id;
}

// --------------------------------------------------------------------------------

/**
 * @brief UART0 IRQ Handler
 * 
 */
static void uart0_irq_callback(void) {

    // read the status-reg to find out which IRQ has been fired

    RP2040_UART_REG* p_uart0 = uart_driver_get_uart0_reg();
    u32 irq_mis = p_uart0->mis;
    p_uart0->icr = UART_DRIVER_UARTICR_CLEAR_ALL;

    DEBUG_TRACE_long(irq_mis, "IRQ_20_Handler() - UARTMIS:");

    if (irq_mis & UART_DRIVER_UARTMIS_TXIM) {

        /**
         * @brief If the FIFOs are enabled and the transmit FIFO is equal to
         * or lower than the programmed trigger level then the transmit
         * interrupt is asserted HIGH. The transmit interrupt is cleared by
         * writing data to the transmit FIFO until it becomes greater than
         * the trigger level, or by clearing the interrupt.
         */
    
        DEBUG_TRACE_long(
            USART0_TX_BUFFER_bytes_available(),
            "IRQ_20_Handler() - UART_DRIVER_UARTMIS_TXIM - BYTES-AVAILABLE:"
        );

        if (USART0_TX_BUFFER_bytes_available()) {
            uart_driver_copy_buffer_to_fifo(
                p_uart0,
                USART0_TX_BUFFER_get_class()
            );
        }
    }

    if (uart_driver_is_rx_fifo_empty(p_uart0) != 0) {

        /**
         * @brief There is some data in the receive-fifo - Read it
         */
    
        DEBUG_TRACE_long(
            USART0_RX_BUFFER_bytes_free(),
            "IRQ_20_Handler() - UART_DRIVER_UARTMIS_RXIM - BYTES-FREE:"
        );

        if (USART0_RX_BUFFER_bytes_free()) {
            uart_driver_copy_fifo_to_buffer(
                p_uart0,
                USART0_RX_BUFFER_get_class()
            );
        }
    }

}

// --------------------------------------------------------------------------------

/**
 * @brief UART1 IRQ Handler
 * 
 */
// static void uart1_irq_callback(void) {

//     // read the status-reg to find out which IRQ has been fired

//     RP2040_UART_REG* p_uart = uart_driver_get_uart1_reg();
//     //u32 irq_mis = p_uart->mis;
//     //u32 irq_fr  = p_uart->fr;
//     p_uart->icr = UART_DRIVER_UARTICR_CLEAR_ALL;
// }

// --------------------------------------------------------------------------------
